import pandas as pd
data=pd.read_excel(r'C:\Users\Jack\OneDrive - mails.ucas.ac.cn\桌面\宅基地筛选1010.xlsx')
#省份数据统计
# print(data.groupby('省（区、市）').count())
list=['湖北省','云南省','四川省','广东省','广西壮族自治区','湖南省','西藏自治区','贵州省','陕西省','黑龙江省']
for i in list:
    a = data[data['省（区、市）'].isin([i])]
    print('{}城中村：{}'.format(i, a[a['村庄与县城的距离'] < 1].count()))
    print('{}近郊村：{}'.format(i, a[a['村庄与县城的距离'] < 15][a[a['村庄与县城的距离'] < 15]['村庄与县城的距离'] >= 1].count()))
    print('{}远郊村：{}'.format(i, a[a['村庄与县城的距离'] < 60][a[a['村庄与县城的距离'] < 60]['村庄与县城的距离'] >= 15].count()))
    print('{}边远村：{}'.format(i,a[a['村庄与县城的距离']>=60].count()))
    print('{}城中村闲置数：{}'.format(i,a[a['村庄与县城的距离'] < 1]['空闲废弃宅基地宗数'].sum()+a[a['村庄与县城的距离'] < 1]['常年闲置宅基地宗数'].sum()+a[a['村庄与县城的距离'] < 1]['季节性闲置宅基地宗数'].sum()))
    print('{}近郊村闲置数：{}'.format(i, a[a['村庄与县城的距离'] < 15][a[a['村庄与县城的距离'] < 15]['村庄与县城的距离'] >= 1]['常年闲置宅基地宗数'].sum() + a[a['村庄与县城的距离'] < 15][a[a['村庄与县城的距离'] < 15]['村庄与县城的距离'] >= 1]['空闲废弃宅基地宗数'].sum() +
                               a[a['村庄与县城的距离'] < 15][a[a['村庄与县城的距离'] < 15]['村庄与县城的距离'] >= 1]['季节性闲置宅基地宗数'].sum()))
    print('{}远郊村闲置数：{}'.format(i, a[a['村庄与县城的距离'] < 60][a[a['村庄与县城的距离'] < 60]['村庄与县城的距离'] >= 15]['常年闲置宅基地宗数'].sum() + a[a['村庄与县城的距离'] < 60][a[a['村庄与县城的距离'] < 60]['村庄与县城的距离'] >= 15]['空闲废弃宅基地宗数'].sum() +
                               a[a['村庄与县城的距离'] < 60][a[a['村庄与县城的距离'] < 60]['村庄与县城的距离'] >= 15]['季节性闲置宅基地宗数'].sum()))
    print('{}边远村闲置数：{}'.format(i, a[a['村庄与县城的距离']>=60]['常年闲置宅基地宗数'].sum() + a[a['村庄与县城的距离']>=60]['空闲废弃宅基地宗数'].sum() +
                               a[a['村庄与县城的距离']>=60]['季节性闲置宅基地宗数'].sum()))

    print('{}城中村出租：{}'.format(i,a[a['村庄与县城的距离'] < 1]['出租（宗）'].sum()))
    print('{}近郊村出租：{}'.format(i, a[a['村庄与县城的距离'] < 15][a[a['村庄与县城的距离'] < 15]['村庄与县城的距离'] >= 1]['出租（宗）'].sum()))
    print('{}远郊村出租：{}'.format(i, a[a['村庄与县城的距离'] < 60][a[a['村庄与县城的距离'] < 60]['村庄与县城的距离'] >= 15]['出租（宗）'].sum()))
    print('{}边远村出租：{}'.format(i, a[a['村庄与县城的距离']>=60]['出租（宗）'].sum()))

    print('{}城中村卖：{}'.format(i, a[a['村庄与县城的距离'] < 1]['出卖（宗）'].sum()))
    print('{}近郊村卖：{}'.format(i, a[a['村庄与县城的距离'] < 15][a[a['村庄与县城的距离'] < 15]['村庄与县城的距离'] >= 1]['出卖（宗）'].sum()))
    print('{}远郊村卖：{}'.format(i, a[a['村庄与县城的距离'] < 60][a[a['村庄与县城的距离'] < 60]['村庄与县城的距离'] >= 15]['出卖（宗）'].sum()))
    print('{}边远村卖：{}'.format(i, a[a['村庄与县城的距离'] >= 60]['出卖（宗）'].sum()))

    print('{}城中村：{}'.format(i, a[a['村庄与县城的距离'] < 1]['村集体是否获得宅基地增值收益'].describe()))
    print('{}近郊村：{}'.format(i, a[a['村庄与县城的距离'] < 15][a[a['村庄与县城的距离'] < 15]['村庄与县城的距离'] >= 1]['村集体是否获得宅基地增值收益'].describe()))
    print('{}远郊村：{}'.format(i, a[a['村庄与县城的距离'] < 60][a[a['村庄与县城的距离'] < 60]['村庄与县城的距离'] >= 15]['村集体是否获得宅基地增值收益'].describe()))
    print('{}边远村：{}'.format(i, a[a['村庄与县城的距离'] >= 60]['村集体是否获得宅基地增值收益'].describe()))
    kk=['经营与流转收益','有偿使用费','有偿选位费','增减挂钩收益','其他']
    for m in kk:
        print('{}是：{}'.format(m,a['收益来源'].isin([m]).describe()))