import pandas as pd
data=pd.read_excel(r'C:\Users\Jack\OneDrive - mails.ucas.ac.cn\桌面\宅基地筛选1010.xlsx')
#省份数据统计
list=['湖北省','云南省','四川省','广东省','广西壮族自治区','湖南省','西藏自治区','贵州省','陕西省','黑龙江省']
for i in list:
    a=data[data['省（区、市）'].isin([i])]
    print('{}zuihou:{}'.format(i,a['最后一次审批宅基地（年份）'].describe()))
    print('{}<1980有:{}'.format(i,a['最后一次审批宅基地（年份）'][a['最后一次审批宅基地（年份）']<=1980].count()))
    print('{}1980到1990有:{}'.format(i, a['最后一次审批宅基地（年份）'][a['最后一次审批宅基地（年份）'] <= 1990][a['最后一次审批宅基地（年份）'][a['最后一次审批宅基地（年份）'] <= 1990]>1980].count()))
    print('{}1990到2000有:{}'.format(i, a['最后一次审批宅基地（年份）'][a['最后一次审批宅基地（年份）'] <= 2000][a['最后一次审批宅基地（年份）'][a['最后一次审批宅基地（年份）'] <= 2000]>1990].count()))
    print('{}2000到2010有:{}'.format(i, a['最后一次审批宅基地（年份）'][a['最后一次审批宅基地（年份）'] <= 2010][a['最后一次审批宅基地（年份）'][a['最后一次审批宅基地（年份）'] <= 2010]>2000].count()))
    print('{}大于2011有:{}'.format(i, a['最后一次审批宅基地（年份）'][a['最后一次审批宅基地（年份）'] >=2011].count()))
    print('不动产证：{}'.format(a['证书类型'].isin(['不动产证']).describe()))
    print('很少{}'.format(a['本村是否有宅基地权属纠纷'].isin(['很少']).describe()))
    print('较多{}'.format(a['本村是否有宅基地权属纠纷'].isin(['较多']).describe()))
    print('严重{}'.format(a['本村是否有宅基地权属纠纷'].isin(['严重']).describe()))
    print('本村是否存在未批先建、乱占耕地建房等宅基地违法现象')
    print('很少{}'.format(a['本村是否存在未批先建、乱占耕地建房等宅基地违法现象'].isin(['很少']).describe()))
    print('较多{}'.format(a['本村是否存在未批先建、乱占耕地建房等宅基地违法现象'].isin(['较多']).describe()))
    print('严重{}'.format(a['本村是否存在未批先建、乱占耕地建房等宅基地违法现象'].isin(['严重']).describe()))
    print('暂不处理：{}'.format(a['本村对超标准占用宅基地、一户占有多处宅基地如何处理'].isin(['暂不处理']).describe()))
    print('无偿：{}'.format(a['本村对超标准占用宅基地、一户占有多处宅基地如何处理'].isin(['无偿强制收回']).describe()))
    print('有偿：{}'.format(a['本村对超标准占用宅基地、一户占有多处宅基地如何处理'].isin(['收取有偿使用费用']).describe()))