import pandas as pd
data=pd.read_excel(r'C:\Users\Jack\OneDrive - mails.ucas.ac.cn\桌面\宅基地筛选1010.xlsx')
#省份数据统计
print(data.groupby('省（区、市）').count())

list=['湖北省','云南省','四川省','广东省','广西壮族自治区','湖南省','西藏自治区','贵州省','陕西省','黑龙江省']
for i in list:
    a=data[data['省（区、市）'].isin([i])]
    ll=['村庄面积','村庄与县城的距离','农户数','村庄人口数','宅基地宗数','宅基地面积','宅基地面积超过本地规定标准的农户数','有两处及以上宅基地的农户数',
        '符合申请条件但未分配宅基地的农户数','空闲废弃宅基地宗数','常年闲置宅基地宗数','季节性闲置宅基地宗数','出租（宗）','出租本村村民(宗)','出卖（宗）','出卖本村村民(宗)','利用情况（宗）',
        '复垦面积（亩）','2019年全村共审批宅基地（宗）','其中占用农用地（宗）',]
    for n in ll:
        print('{}:{}之和是{}'.format(i,n,a[n].sum()))
        print('{}:{}平均是{}'.format(i,n,a[n].mean()))
    jj=['本村是否存在农房出租、出卖等流转情况','本村是否存在利用农房开展农家乐、民宿等经营性活动的情况','本村是否开展了闲置宅基地复垦','本地是否停止了宅基地审批','本村是否编制了村庄规划','本村是否制定了宅基地分配办法','本村宅基地和农房是否发证',
        '本村是否建设了农村新社区或农民公寓、农民小区等集中居住区','村集体是否获得宅基地增值收益']
    for s in jj:
        print('{}开展情况{}'.format(s,a[s].describe()))